[
  {
    "id": 1,
    "year": "Jan 2025 - Present",
    "role": "Software Engineer Intern (AI/ML)",
    "company": "Pearson VUE, Bloomington, MN",
    "image": "images/Pearson.png",
    "description": [
      "Built a Copilot agent with Teams Toolkit that surfaces precise answers from internal docs, slashing employee lookup time from minutes to seconds.",
      "Prototyped a CrewAI multi-agent workflow that auto-summarizes Teams meetings and emails minutes, eliminating manual note-taking and proving CrewAI's integration value.",
      "Integrated DiskANN vector indexing into the RAG service on PostgreSQL, 3x similarity-search speed and cutting retrieval latency.",
      "Built an MCP server on Bookings-API with Claude + Perplexity for one-chat scheduling and related recommendations."
    ],
    "technologies": [
      "Teams Toolkit",
      "CrewAI",
      "DiskANN",
      "PostgreSQL",
      "RAG",
      "Claude",
      "Perplexity"
    ]
  },
  {
    "id": 2,
    "year": "May 2024 - Dec 2024",
    "role": "Software Engineer Intern (Full Stack Development)",
    "company": "Pearson VUE, Bloomington, MN",
    "image": "images/Pearson.png",
    "description": [
      "Implemented Angular components and services to handle dynamic data binding and improve modularity, ensuring seamless integration of the ST Receipt feature with existing application architecture.",
      "Optimized performance by refactoring complex Angular code into reusable modules, reducing redundancy and enhancing maintainability.",
      "Created custom Angular directives and pipes for efficient manipulation and display of ST Receipt data, adhering to the DRY principle.",
      "Integrated backend APIs using Angular's HttpClient to fetch, post, and update data for the ST Receipt feature, ensuring robust communication between the frontend and backend.",
      "Enhanced error handling mechanisms in Angular services and components by implementing interceptor logic for consistent error messaging and logging.",
      "Conducted in-depth unit testing using Jasmine and Karma for Angular components and services, achieving >90% code coverage and ensuring application reliability.",
      "Designed and implemented database queries and transactions in SQL to manage ST Receipt data, optimizing execution time and ensuring accurate data handling.",
      "Configured and deployed Helm charts for Azure Kubernetes Service (AKS) clusters, enabling scalable and consistent deployment of containerized services.",
      "Set up and maintained CI/CD pipelines using Azure DevOps and YAML scripts, automating build and deployment processes to achieve faster delivery cycles.",
      "Debugged and resolved cross-environment issues by leveraging tools like Postman for API testing, Azure DevOps logs, and browser developer tools for frontend issues.",
      "Updated business rules in SQL scripts to accommodate evolving requirements, performing data migrations and maintaining backward compatibility across client systems.",
      "Managed complex deployment configurations in TeamCity, customizing build steps and deployment strategies to align with the project requirements.",
      "Collaborated with cross-functional teams, including QA and DevOps, to implement end-to-end testing frameworks and smooth deployment pipelines.",
      "Documented system updates and deployment procedures, ensuring future maintainability and clarity for development and operations teams.",
      "Monitored and resolved production bugs, using logs and monitoring tools like Azure Monitor and Application Insights to minimize downtime."
    ],
    "technologies": [
      "Angular",
      "Spring Boot",
      "Azure",
      "TeamCity",
      "SQL"
    ]
  },
  {
    "id": 3,
    "year": "May 2023 - Aug 2023",
    "role": "Software Engineer Intern (Full Stack Development)",
    "company": "NCR Corporation, Atlanta, GA",
    "image": "images/NCR_Corporation_logo.svg.png",
    "description": [
      "Developed and deployed the 'Fees' feature in Aloha Order Direct, a critical enhancement impacting over 95% of customer transactions by enabling dynamic fee calculations and seamless integration with existing checkout workflows.",
      "Designed and implemented responsive and interactive UI components using Next.js, ensuring cross-browser compatibility and optimal performance across devices.",
      "Leveraged GraphQL middleware to streamline communication between the frontend and backend, reducing data retrieval times and enhancing application performance.",
      "Developed backend services with Nest.js, implementing robust fee calculation logic, secure API endpoints, and effective error-handling mechanisms to ensure system reliability.",
      "Collaborated closely with an 8-member Agile team, participating in sprint planning, backlog refinement, and daily stand-ups to deliver features on schedule while adhering to Agile best practices.",
      "Executed comprehensive unit and integration testing using Jest and React Testing Library, achieving 100% test coverage to ensure the feature's functionality and maintain high code quality standards.",
      "Created mocks and test doubles for GraphQL API responses, simulating backend interactions during testing to decouple dependencies and enhance test reliability.",
      "Optimized feature deployment using CI/CD pipelines, ensuring smooth and automated integration of the 'Fees' feature into production environments.",
      "Ensured backward compatibility of the 'Fees' feature by conducting regression testing and collaborating with QA teams to validate existing workflows and customer scenarios.",
      "Documented feature functionality, API contracts, and architectural design for the 'Fees' module, facilitating seamless handoffs and future maintenance."
    ],
    "technologies": [
      "Next.js",
      "GraphQL",
      "Nest.js",
      "Jest",
      "React Testing Library"
    ]
  },
  {
    "id": 4,
    "year": "May 2022 - Aug 2022",
    "role": "Software Engineer Intern (iOS Development)",
    "company": "NCR Corporation, Atlanta, GA",
    "image": "images/NCR_Corporation_logo.svg.png",
    "description": [
      "Spearheaded the intern team's proof of concept by successfully migrating 100% of RESTful API calls from NOLO legacy to Mercury, ensuring enhanced system scalability and improved performance.",
      "Refactored existing API endpoints to align with Mercury's modern architecture, optimizing request-response cycles and reducing latency by 25%.",
      "Implemented server-side rendering (SSR) to streamline data retrieval, reducing client-side processing load and improving page load times by 30%.",
      "Collaborated with backend engineers to design and implement a middleware layer, enabling secure and efficient API consumption for consumer-facing applications.",
      "Developed and deployed reusable customer-centric UI components using React.js, ensuring compatibility with Mercury's backend services and adhering to best coding practices.",
      "Optimized frontend performance by integrating lazy loading and memoization techniques, enhancing the efficiency of data-driven UI updates.",
      "Utilized Postman and Swagger to test and validate new API integrations, ensuring compliance with RESTful API standards and consistent behavior across endpoints."
    ],
    "technologies": [
      "iOS Development",
      "Swift",
      "RESTful API"
    ]
  }
]